Revit 2027 API
DirectShapeReferenceOptions Constructor
 Constructs a new DirectShapeRefOptions instance with default settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DirectShapeReferenceOptions()
Public Sub New
public:
DirectShapeReferenceOptions()
new : unit -> DirectShapeReferenceOptions
See Also
Reference
DirectShapeReferenceOptions Class
DirectShapeReferenceOptions Overload
Autodesk.Revit.DB Namespace